In [1]:
import pandas as pd

In [13]:
data1={'name':['mohammad','ali','shahrzad'], 'gender':['m','m','f']}
df1=pd.DataFrame(data1)
df1

       name gender
0  mohammad      m
1       ali      m
2  shahrzad      f

In [4]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
list(df1.index)

[0, 1, 2]

In [14]:
data2={'name':['atosa','mostafa','yasamin'], 'gender':['f','m','f']}
df2=pd.DataFrame(data2)
df2

      name gender
0    atosa      f
1  mostafa      m
2  yasamin      f

In [36]:
df=df1.append(df2, ignore_index=True)
df

C:\Users\moham\AppData\Local\Temp\ipykernel_20420\2480622890.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df1.append(df2, ignore_index=True)

       name gender
0  mohammad      m
1       ali      m
2  shahrzad      f
3     atosa      f
4   mostafa      m
5   yasamin      f

In [37]:
df.index+=1
df

       name gender
1  mohammad      m
2       ali      m
3  shahrzad      f
4     atosa      f
5   mostafa      m
6   yasamin      f

In [38]:
df.index=df['name']
df

              name gender
name
mohammad  mohammad      m
ali            ali      m
shahrzad  shahrzad      f
atosa        atosa      f
mostafa    mostafa      m
yasamin    yasamin      f

In [39]:
df=df.set_index('name')
df

         gender
name
mohammad      m
ali           m
shahrzad      f
atosa         f
mostafa       m
yasamin       f

In [41]:
df=df.reset_index()
df

       name gender
0  mohammad      m
1       ali      m
2  shahrzad      f
3     atosa      f
4   mostafa      m
5   yasamin      f